Yang-S-K/smartFan/Code/STM32/main.c
			  case 'C':
				  vAngle_state = !vAngle_state;
				  break;
			  case '9':
				  vAngle_state=0;
				  if(fanStatus.vAngle<=0){
					  fanStatus.vAngle=0;
				  }else{
					  fanStatus.vAngle-=10;
				  }
				  break;
			  case '8':
				  vAngle_state=0;
				  fanStatus.vAngle=50;
				  break;
			  case '7':
				  vAngle_state=0;
				  if(fanStatus.vAngle>=100){
					  fanStatus.vAngle=100;
				  }else{
					  fanStatus.vAngle+=10;
				  }
				  break;
			  default:
				  break;
		  }
		  HAL_Delay(300); // ?��止�??續觸?��
	  }

	  //??��?��?�更?��??��?�傳給ESP32
      if (fanStatus.fanState != oldFanState||fanStatus.fanSpeed != oldFanSpeed||fanStatus.hAngle != oldFanhAngle||fanStatus.vAngle != oldFanvAngle||oldtemperature!=temperature) {  // **?��?��??�改變�?�發??**
          SendDataToESP32(fanStatus.fanState, fanStatus.fanSpeed, fanStatus.hAngle, fanStatus.vAngle,temperature);
          oldFanState = fanStatus.fanState;
          oldFanSpeed = fanStatus.fanSpeed;
          oldFanhAngle = fanStatus.hAngle;
          oldFanvAngle = fanStatus.vAngle;
          oldtemperature = temperature;
      }

      //AccessPort顯示
      sprintf(str,"State: %d\r\n Speed: %d%%\r\n hAngle_state: %d\r\n hAngle: %d\r\n vAngle_state: %d\r\n vAngle: %d\r\n T: %f\r\n tempKey: %c\r\n PIR_Flags: %d\r\n",fanStatus.fanState,fanStatus.fanSpeed,hAngle_state,(int)(fanStatus.hAngle*1.8),vAngle_state,(int)(fanStatus.vAngle*0.9),temperature,tempKey,PIR_Flags);
	  HAL_UART_Transmit(&huart3, (uint8_t*)str, strlen(str), 100);
      if (HAL_GetTick() - lastUpdate >= 500) {
          lastUpdate = HAL_GetTick(); // ?��?��??��??
          LCD_Clear();
          sprintf(strC1,"F%d S:%d T:%d P:%d",fanStatus.fanState,fanStatus.fanSpeed,(int)temperature,PIR_Flags);
		  LCD_SetCursor(0, 0);
		  LCD_Print(strC1);
		  sprintf(strC2,"h%d %3d v%d %2d K:%c",hAngle_state,(int)(fanStatus.hAngle*1.8),vAngle_state,(int)(fanStatus.vAngle*0.9),tempKey);
		  LCD_SetCursor(1, 0);
		  LCD_Print(strC2);
      }
	  memset(str, 0, sizeof(str));
	  memset(strC1, 0, sizeof(strC1));
	  memset(strC2, 0, sizeof(strC2));
	  HAL_Delay(100);

//      */

  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 168;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_AnalogWDGConfTypeDef AnalogWDGConfig = {0};
  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */

  /** Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
  hadc1.Init.Resolution = ADC_RESOLUTION_12B;
  hadc1.Init.ScanConvMode = ENABLE;
  hadc1.Init.ContinuousConvMode = ENABLE;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.NbrOfConversion = 1;
  hadc1.Init.DMAContinuousRequests = DISABLE;
  hadc1.Init.EOCSelection = ADC_EOC_SEQ_CONV;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure the analog watchdog
  */
  AnalogWDGConfig.WatchdogMode = ADC_ANALOGWATCHDOG_SINGLE_REG;
  AnalogWDGConfig.HighThreshold = 0;
  AnalogWDGConfig.LowThreshold = 0;
  AnalogWDGConfig.Channel = ADC_CHANNEL_10;
  AnalogWDGConfig.ITMode = DISABLE;
  if (HAL_ADC_AnalogWDGConfig(&hadc1, &AnalogWDGConfig) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_10;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN ADC1_Init 2 */

  /* USER CODE END ADC1_Init 2 */

}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

  /* USER CODE BEGIN I2C1_Init 1 */

  /* USER CODE END I2C1_Init 1 */
  hi2c1.Instance = I2C1;
  hi2c1.Init.ClockSpeed = 100000;
  hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
  hi2c1.Init.OwnAddress1 = 0;
  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c1.Init.OwnAddress2 = 0;
  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Analogue filter
  */
  if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Digital filter
  */
  if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2C1_Init 2 */

